In [1]:
# Import dependencies
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# Import PostgreSQL password
from config import db_password

## Data Cleaning

### CO2 Emissions

In [2]:
# grab our raw data from the github page
url = 'https://raw.githubusercontent.com/owid/co2-data/master/owid-co2-data.csv'
emissions_df = pd.read_csv(url)

emissions_df.head()

,iso_code,country,year,co2,co2_per_capita,trade_co2,cement_co2,cement_co2_per_capita,coal_co2,coal_co2_per_capita,...,ghg_excluding_lucf_per_capita,methane,methane_per_capita,nitrous_oxide,nitrous_oxide_per_capita,population,gdp,primary_energy_consumption,energy_per_capita,energy_per_gdp
0,AFG,Afghanistan,1949,0.015,0.002,NaN,NaN,NaN,0.015,0.002,...,NaN,NaN,NaN,NaN,NaN,7624058.0,NaN,NaN,NaN,NaN
1,AFG,Afghanistan,1950,0.084,0.011,NaN,NaN,NaN,0.021,0.003,...,NaN,NaN,NaN,NaN,NaN,7752117.0,9.421400e+09,NaN,NaN,NaN
2,AFG,Afghanistan,1951,0.092,0.012,NaN,NaN,NaN,0.026,0.003,...,NaN,NaN,NaN,NaN,NaN,7840151.0,9.692280e+09,NaN,NaN,NaN
3,AFG,Afghanistan,1952,0.092,0.012,NaN,NaN,NaN,0.032,0.004,...,NaN,NaN,NaN,NaN,NaN,7935996.0,1.001733e+10,NaN,NaN,NaN
4,AFG,Afghanistan,1953,0.106,0.013,NaN,NaN,NaN,0.038,0.005,...,NaN,NaN,NaN,NaN,NaN,8039684.0,1.063052e+10,NaN,NaN,NaN

In [3]:
# Pivot DataFrame with values being each country's total CO2 emissions for each year
# Only need these 3 columns from original dataframe
emissions_df = emissions_df.pivot(index='country', columns='year', values='co2')

# Keep only rows with at least 31 non-null values and replace nulls with 0
# thresh=31 drops 17 rows, including all rows with nan for 2020
emissions_df.dropna(thresh=31, inplace=True)
emissions_df.fillna(0, inplace=True)

# Format DataFrame
emissions_df.reset_index(inplace=True)
emissions_df.rename_axis(None, axis = 1, inplace=True)

emissions_df

,country,1750,1751,1752,1753,1754,1755,1756,1757,1758,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Afghanistan,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,12.106,10.219,8.441,7.774,7.904,6.745,6.860,8.345,12.147,12.160
1,Africa,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,1258.709,1253.144,1260.316,1363.500,1322.735,1356.719,1384.372,1385.645,1408.479,1326.044
2,Albania,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,5.031,4.668,4.928,5.621,4.496,4.492,5.302,4.734,4.863,4.535
3,Algeria,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,119.808,128.111,132.435,142.529,149.683,148.929,154.936,161.487,166.642,154.995
4,Andorra,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,0.491,0.487,0.476,0.462,0.465,0.469,0.465,0.495,0.502,0.466
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226,Vietnam,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,151.231,142.552,149.220,169.006,193.004,192.766,195.249,223.718,260.312,254.303
227,World,9.351,9.351,9.354,9.354,9.358,9.362,10.006,10.01,10.014,...,34468.451,34974.075,35283.025,35534.443,35496.406,35452.459,35925.738,36646.140,36702.503,34807.259
228,Yemen,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,20.190,18.268,24.976,24.216,12.806,10.427,9.951,9.984,10.020,9.768
229,Zambia,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,3.372,4.166,4.416,4.877,5.098,5.659,6.517,7.313,7.047,6.573
230,Zimbabwe,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.00,0.000,...,9.744,7.883,11.836,11.906,12.226,10.738,9.582,11.854,10.949,10.531

### Surface Temperatures

In [4]:
# Read in land temperatures dataset
csv_path = 'GlobalLandTemperaturesByCountry.csv'
temps_df = pd.read_csv(csv_path)

temps_df.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [5]:
# Create new column that grabs the year as an integer from the dt column
temps_df['Year'] = [int(year) for year in temps_df['dt'].str[:4]]

temps_df.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country  Year
0  1743-11-01               4.384                          2.294   Åland  1743
1  1743-12-01                 NaN                            NaN   Åland  1743
2  1744-01-01                 NaN                            NaN   Åland  1744
3  1744-02-01                 NaN                            NaN   Åland  1744
4  1744-03-01                 NaN                            NaN   Åland  1744

In [6]:
# Filter for years 1750 and beyond to match carbon emissions dataset
temps_df = temps_df[temps_df['Year'] >= 1750]
temps_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Year
74,1750-01-01,1.091,1.119,Åland,1750
75,1750-02-01,0.809,3.353,Åland,1750
76,1750-03-01,0.923,4.716,Åland,1750
77,1750-04-01,3.943,1.434,Åland,1750
78,1750-05-01,6.265,1.339,Åland,1750

In [7]:
# Get each country's average annual land temperature using groupby
temps_df = temps_df.groupby(["Country", "Year"]).mean()
temps_df.reset_index(inplace=True)

temps_df.head()

       Country  Year  AverageTemperature  AverageTemperatureUncertainty
0  Afghanistan  1838           18.379571                       2.756000
1  Afghanistan  1839                 NaN                            NaN
2  Afghanistan  1840           13.413455                       2.502000
3  Afghanistan  1841           13.997600                       2.452100
4  Afghanistan  1842           15.154667                       2.381222

In [8]:
# Pivot DataFrame with values being each country's average land temperature for each year
temps_df = temps_df.pivot(index='Country', columns='Year', values='AverageTemperature')

# Reset index
temps_df.reset_index(inplace=True)
temps_df.rename_axis(None, axis = 1, inplace=True)

# Keep only rows with at least 50 non-null values and replace nulls with 0
temps_df.dropna(thresh=50, inplace=True)
temps_df.fillna(0, inplace=True)

# Round all values to 3 decimal places
df_country = temps_df['Country']
temps_df = temps_df.drop('Country', axis=1).round(3)
temps_df.insert(0, 'Country', df_country)

temps_df

,Country,1750,1751,1752,1753,1754,1755,1756,1757,1758,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,15.771,14.980,15.596,15.106,15.216,15.258,15.829,15.518,14.482,16.534
1,Africa,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,24.896,25.156,24.819,24.852,24.755,25.027,25.472,24.786,24.726,25.209
2,Albania,13.098,13.573,8.240,12.557,12.548,12.323,13.026,12.730,11.444,...,13.258,12.747,12.977,13.891,13.955,13.844,13.775,13.443,13.768,14.994
3,Algeria,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,23.916,24.223,24.201,24.065,23.950,24.154,25.216,24.144,23.955,25.122
4,American Samoa,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,27.281,27.374,27.081,27.452,26.995,27.034,27.453,27.010,27.201,27.517
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
238,Western Sahara,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,23.421,23.508,23.442,23.145,23.323,23.381,24.114,23.401,23.303,23.744
239,Yemen,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,27.334,27.295,27.175,27.311,26.808,27.342,27.303,27.288,27.445,28.130
240,Zambia,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,21.768,22.814,21.784,21.838,21.536,21.670,22.268,21.772,21.698,21.196
241,Zimbabwe,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,21.331,22.510,21.619,21.604,21.546,21.377,21.986,21.602,21.521,20.711
242,Åland,6.293,5.397,1.625,5.118,5.118,4.733,5.160,5.414,4.075,...,6.519,6.724,7.101,7.029,7.492,6.489,4.862,7.171,6.064,6.230

## Export to SQL

In [9]:
# Create engine instance - usually port 5432
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5433/carbon_db"
engine = create_engine(db_string)

### CO2 Emissions

In [11]:
# Write cleaned emissions dataframe to sql database
emissions_df.to_sql(name="carbon_emissions", index=False, con=engine)

### Surface Temperatures

In [12]:
# Write cleaned temperatures dataframe to sql database
temps_df.to_sql(name="surface_temperatures", index=False, con=engine)